[
 {
  "msg": "The administrator on the \"calc\" challenge is using HeadlessChrome/79.0.3945.0.", 
  "time": 1573237890
 }, 
 {
  "msg": "The files for \"HARPA Hyper quantum Login system\" have been updated, *please download again*!", 
  "time": 1573238764
 }, 
 {
  "msg": "If you suffer connectivity problems to the UFSCar network (200.136.252.0/22 and 200.136.213.0/24), you may use https://ufscar-bkp.pwn2.win/ufscar-bkp.ovpn to get an alternative route.", 
  "time": 1573241121
 }, 
 {
  "msg": "AstroBot is being fixed, wait pls", 
  "time": 1573242338
 }, 
 {
  "msg": "AstroBot (NY3) should be ok now guys. We are working on AMS3", 
  "time": 1573243452
 }, 
 {
  "msg": "AstroBot (AMS3) should be working now as well", 
  "time": 1573243985
 }, 
 {
  "msg": "AstroBot (AMS3) new IP is 178.128.245.211. We will update the description too!", 
  "time": 1573244286
 }, 
 {
  "msg": "More web(s) soon guys! :)", 
  "time": 1573247868
 }, 
 {
  "msg": "New web released: Message Keeper, have fun and try hard!", 
  "time": 1573250340
 }, 
 {
  "msg": "[HARPA Hyper quantum Login system] Chall is under maintenance, wait a little while we fix it and upload the updated version", 
  "time": 1573250541
 }, 
 {
  "msg": "New files for HARPA Hyper quantum Login system are online, please download again", 
  "time": 1573253051
 }, 
 {
  "msg": "Another minor fix for HARPA Hyper quantum Login system. Sorry about that, download again please!", 
  "time": 1573254599
 }, 
 {
  "msg": "[HARPA Hyper quantum Login system] OK, thats our last patch to this chall. Sorry for the mess, download again please", 
  "time": 1573260537
 }, 
 {
  "msg": "New web released: Baby Recruiter. Have fun! :)", 
  "time": 1573261326
 }, 
 {
  "msg": "Come on guys, submit your flags and fight for a spot for the next Pro CTF", 
  "time": 1573265324
 }, 
 {
  "msg": "Future Message challenges should be ok now, have fun!", 
  "time": 1573276962
 }, 
 {
  "msg": "[AstroBot] Alternative IP with better latency for brazilians teams: 200.136.213.39", 
  "time": 1573294928
 }, 
 {
  "msg": "Follow us on twitter: @pwn2win and @eltctfbr", 
  "time": 1573300981
 }, 
 {
  "msg": "Now we have a chart with team progress: https://pwn2.win/2019/#/rank", 
  "time": 1573309932
 }, 
 {
  "msg": "Due to routing issues, iot.pwn2.win IP address was changed to 200.136.213.253. Please pay attention if you are using the IP address directly instead of the domain name.", 
  "time": 1573313748
 }, 
 {
  "msg": "Hint for Harpa Hyper Login: even quantum Systems are just Linear operators in disguise. Quantum Information algorithms can be implemented following any convention for the order of qubits in the registers", 
  "time": 1573315631
 }, 
 {
  "msg": "Federated Sophia main server and backup server should be ok now.", 
  "time": 1573322316
 }, 
 {
  "msg": "More instances (bots) for Botnet challenge are running! Hint: EVERY detail about the environment/network matters, look around carefully! Race condition is not the right approach.", 
  "time": 1573342545
 }, 
 {
  "msg": "Hardware Trojan Part 2 now has two boards at two different physical locations - iot.pwn2.win resolves to 200.136.213.253 and 179.234.188.75", 
  "time": 1573348817
 }, 
 {
  "msg": "9 hours remains, submit your flags guys! :)", 
  "time": 1573371430
 }, 
 {
  "msg": "[Baby Recruiter] For now, use mirror box to solve the challenge.", 
  "time": 1573374914
 }, 
 {
  "msg": "Hardware Trojan Part 2 firewall rate limit was relaxed - now we allow 10 SYN / second / IP address. However brute force should not be needed if you do it the right way!", 
  "time": 1573376958
 }
]